Simulations/base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       83282;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       83302;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          82922;
        startFace       83322;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       166244;
    }
    topdown
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          88;
        startFace       166244;
    }
    airfoil
    {
        type            wall;
        inGroups        2(airfoil wall);
        nFaces          290;
        startFace       166332;
    }
)

// ************************************************************************* //
