Simulations/base/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-12 -10 -0.1)
    (32 -10 -0.1)
    (32  10 -0.1)
    (-12  10 -0.1)
    (-12 -10 0.1)
    (32 -10 0.1)
    (32  10 0.1)
    (-12  10 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (44 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    front
    {
        type  patch; //empty;
        faces
        (
            (0 3 2 1)
        );
    }

    back
    {
        type  patch; //empty;
        faces
        (
            (4 5 6 7)
        );
    }

    topdown
    {
        type patch; //wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
);


// ************************************************************************* //
